Revit 2027 API
ParameterTypeId.ContinuousrailBeginningTerminationAttachmentParam Property
 "Extension Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousrailBeginningTerminationAttachmentParam { get; }
Public Shared ReadOnly Property ContinuousrailBeginningTerminationAttachmentParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousrailBeginningTerminationAttachmentParam {
	ForgeTypeId^ get ();
}
static member ContinuousrailBeginningTerminationAttachmentParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace